{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-CellLine",
    "2": "I-CellLine",
    "3": "B-ChemicalEntity",
    "4": "I-ChemicalEntity",
    "5": "B-DiseaseOrPhenotypicFeature",
    "6": "I-DiseaseOrPhenotypicFeature",
    "7": "B-GeneOrGeneProduct",
    "8": "I-GeneOrGeneProduct",
    "9": "B-OrganismTaxon",
    "10": "I-OrganismTaxon",
    "11": "B-SequenceVariant",
    "12": "I-SequenceVariant"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-CellLine": 1,
    "B-ChemicalEntity": 3,
    "B-DiseaseOrPhenotypicFeature": 5,
    "B-GeneOrGeneProduct": 7,
    "B-OrganismTaxon": 9,
    "B-SequenceVariant": 11,
    "I-CellLine": 2,
    "I-ChemicalEntity": 4,
    "I-DiseaseOrPhenotypicFeature": 6,
    "I-GeneOrGeneProduct": 8,
    "I-OrganismTaxon": 10,
    "I-SequenceVariant": 12,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.11.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
